Revit 2027 API
ScheduleDefinition.IsValidCategoryForFilterBySheet Method
 Checks whether a schedule can be filtered by sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidCategoryForFilterBySheet()
Public Function IsValidCategoryForFilterBySheet As Boolean
public:
bool IsValidCategoryForFilterBySheet()
member IsValidCategoryForFilterBySheet : unit -> bool
Return Value
Boolean
 True if the schedule can be filtered by sheet, false otherwise.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace